<h1>Modulo Pandas</h1>

<p>Importar el modulo pandas</p>

In [49]:
import pandas as pd

In [189]:
!pip list

Package                   Version
------------------------- --------------
anyio                     4.3.0
argon2-cffi               23.1.0
argon2-cffi-bindings      21.2.0
arrow                     1.3.0
asttokens                 2.4.1
async-lru                 2.0.4
attrs                     23.2.0
Babel                     2.14.0
beautifulsoup4            4.12.3
bleach                    6.1.0
certifi                   2024.2.2
cffi                      1.16.0
charset-normalizer        3.3.2
colorama                  0.4.6
comm                      0.2.2
debugpy                   1.8.1
decorator                 5.1.1
defusedxml                0.7.1
executing                 2.0.1
fastjsonschema            2.19.1
fqdn                      1.5.1
h11                       0.14.0
httpcore                  1.0.5
httpx                     0.27.0
idna                      3.7
ipykernel                 6.29.4
ipython                   8.23.0
ipywidgets                8.1.2
isoduration               20.11.0
jedi                      0.19.1
Jinja2                    3.1.3
json5                     0.9.25
jsonpointer               2.4
jsonschema                4.21.1
jsonschema-specifications 2023.12.1
jupyter                   1.0.0
jupyter_client            8.6.1
jupyter-console           6.6.3
jupyter_core              5.7.2
jupyter-events            0.10.0
jupyter-lsp               2.2.5
jupyter_server            2.14.0
jupyter_server_terminals  0.5.3
jupyterlab                4.1.6
jupyterlab_pygments       0.3.0
jupyterlab_server         2.26.0
jupyterlab_widgets        3.0.10
MarkupSafe                2.1.5
matplotlib-inline         0.1.7
mistune                   3.0.2
nbclient                  0.10.0
nbconvert                 7.16.3
nbformat                  5.10.4
nest-asyncio              1.6.0
notebook                  7.1.3
notebook_shim             0.2.4
numpy                     1.26.4
overrides                 7.7.0
packaging                 24.0
pandas                    2.2.2
pandocfilters             1.5.1
parso                     0.8.4
pip                       24.0
platformdirs              4.2.0
prometheus_client         0.20.0
prompt-toolkit            3.0.43
psutil                    5.9.8
pure-eval                 0.2.2
pycparser                 2.22
Pygments                  2.17.2
python-dateutil           2.9.0.post0
python-json-logger        2.0.7
pytz                      2024.1
pywin32                   306
pywinpty                  2.0.13
PyYAML                    6.0.1
pyzmq                     26.0.0
qtconsole                 5.5.1
QtPy                      2.4.1
referencing               0.34.0
requests                  2.31.0
rfc3339-validator         0.1.4
rfc3986-validator         0.1.1
rpds-py                   0.18.0
Send2Trash                1.8.3
setuptools                65.5.0
six                       1.16.0
sniffio                   1.3.1
soupsieve                 2.5
stack-data                0.6.3
terminado                 0.18.1
tinycss2                  1.2.1
tornado                   6.4
traitlets                 5.14.2
types-python-dateutil     2.9.0.20240316
typing_extensions         4.11.0
tzdata                    2024.1
uri-template              1.3.0
urllib3                   2.2.1
wcwidth                   0.2.13
webcolors                 1.13
webencodings              0.5.1
websocket-client          1.7.0
widgetsnbextension        4.0.10

## Series

<p>Crear una serie</p>

In [50]:
lista = ['Juan', 'Pedrio', 'Estefania', 'Ana', 'Esteban']
serie = pd.Series(lista, dtype="string")
serie

0         Juan
1       Pedrio
2    Estefania
3          Ana
4      Esteban
dtype: string

<p>Crear un diccionario</p>

In [51]:
diccionario = dict([(0,'Juan'), (1,'Pedro'), (2,'Estefania'), (3,'Ana'), (4,'Esteban')])
diccionario = {key:lista[key] for key in range(len(lista))}
serie = pd.Series(diccionario)
diccionario
serie

0         Juan
1       Pedrio
2    Estefania
3          Ana
4      Esteban
dtype: object

In [52]:
print('Longitud:', serie.size)

Longitud: 5

In [53]:
print('indices de la serie:', serie.index)

indices de la serie: Index([0, 1, 2, 3, 4], dtype='int64')

In [54]:
print('Tipo:', serie.dtype)

Tipo: object

In [55]:
serie[0:3]

0         Juan
1       Pedrio
2    Estefania
dtype: object

In [56]:
serie[2:]

2    Estefania
3          Ana
4      Esteban
dtype: object

In [57]:
# Acceder a los elementos de la serie por indice
serie[0]

'Juan'

In [58]:
serie[2:]

2    Estefania
3          Ana
4      Esteban
dtype: object

In [59]:
serie[len(serie) - 1]

'Esteban'

In [60]:
serie[[0,3]]

0    Juan
3     Ana
dtype: object

In [61]:
# apply sirve para ejecutar funciones, aqui lo que hacemos es ejecutar un lambda (funcion anonima o funcion sin nombre) con apply.
serie.apply(lambda nombre: nombre.upper())

0         JUAN
1       PEDRIO
2    ESTEFANIA
3          ANA
4      ESTEBAN
dtype: object

# Ejercicios

## Serie

<p>Crear una serie de numeros y retornar la serie multiplicados * 2</p>

In [62]:
numeros = list(range(100 + 1))
mi_serie = pd.Series(numeros, dtype='int64')
mi_serie.apply(lambda num: num * 2)

0        0
1        2
2        4
3        6
4        8
      ...
96     192
97     194
98     196
99     198
100    200
Length: 101, dtype: int64

<p>Con la serie de nombres creada anteriormente, retornar solo los que tienen mas de 4 caracteres.</p>

In [63]:
"""serie.apply(lambda nombre: nombre if len(nombre) > 4 else "")"""
filtro = serie.apply(lambda nombre: len(nombre) > 4)
serie[filtro]

1       Pedrio
2    Estefania
4      Esteban
dtype: object

<p>Crear un filtro para que solo me devuelva Juan y Ana</p>

In [64]:
'''
filtro = serie.apply(lambda nombre: len(nombre) <= 4)
serie[filtro]

filtro = serie.apply(lambda nombre: nombre in ['Juan', 'Ana'])
serie[filtro]
'''
serie[(serie == 'Juan') | (serie == 'Ana')]

0    Juan
3     Ana
dtype: object

## DataFrames

<p>Importar el modulo pandas</p>

In [136]:
import pandas as pd

In [137]:
data2 = [['Juan', 4.5], ['Pedro', 8.91], ['Estefania', 1.4], ['Ana', 5.6], ['Esteban', 7.8]]
columnas = ['Nombre', 'Nota']
filas = list(range(len(data2))) # [0,1,2,3,4]
matriz = pd.DataFrame(data=data2, columns=columnas, index=filas)
matriz

      Nombre  Nota
0       Juan  4.50
1      Pedro  8.91
2  Estefania  1.40
3        Ana  5.60
4    Esteban  7.80

In [138]:
matriz.info

<bound method DataFrame.info of       Nombre  Nota
0       Juan  4.50
1      Pedro  8.91
2  Estefania  1.40
3        Ana  5.60
4    Esteban  7.80>

In [139]:
matriz.shape # Muestra el numero de filas y el numero de columnas (filas, columnas)

(5, 2)

In [140]:
matriz.size # muestra el numero de celdas (num_filas * num_columnas)

10

In [141]:
matriz.columns # muestra las columnas

Index(['Nombre', 'Nota'], dtype='object')

In [142]:
matriz.index # muestra el alcance o rango

Index([0, 1, 2, 3, 4], dtype='int64')

In [143]:
matriz.head(3) # Muestra las x primeras filas

      Nombre  Nota
0       Juan  4.50
1      Pedro  8.91
2  Estefania  1.40

In [144]:
matriz.tail(3) # Muestra las x ultimas filas

      Nombre  Nota
2  Estefania   1.4
3        Ana   5.6
4    Esteban   7.8

In [145]:
diccionario = {"Id": [1,2,3,4,5] ,
                "Nombre" : ['Juan', 'Pedro','Estefania', 'Ana', 'Esteban'],
                "Apellido": ['Garcia', 'Sanchez', 'Lopez', 'Garcia', 'Gonzalez' ],
                "Notas": [4.5, 8.9, 1.4, 5.6, 7.8]
                }
matriz_2 = pd.DataFrame(diccionario)
matriz_2

   Id     Nombre  Apellido  Notas
0   1       Juan    Garcia    4.5
1   2      Pedro   Sanchez    8.9
2   3  Estefania     Lopez    1.4
3   4        Ana    Garcia    5.6
4   5    Esteban  Gonzalez    7.8

In [146]:
matriz_2.info

<bound method DataFrame.info of    Id     Nombre  Apellido  Notas
0   1       Juan    Garcia    4.5
1   2      Pedro   Sanchez    8.9
2   3  Estefania     Lopez    1.4
3   4        Ana    Garcia    5.6
4   5    Esteban  Gonzalez    7.8>

In [147]:
nombre = [{'Id': 6, 'Nombre': 'Silvia', 'Apellido': 'Gonzalez', 'Nota': 5.5},
         {'Id': 7, 'Nombre': 'Pedro', 'Apellido': 'Perez', 'Nota': 8.9}]
matriz_3 = pd.DataFrame(nombre)
matriz_3

   Id  Nombre  Apellido  Nota
0   6  Silvia  Gonzalez   5.5
1   7   Pedro     Perez   8.9

In [232]:
# Acceso a los datos:
# iloc[] -> acceos por posicion
diccionario = {"Id": [1,2,3,4,5] ,
                "Nombre" : ['Juan', 'Pedro','Estefania', 'Ana', 'Esteban'],
                "Apellido": ['Garcia', 'Sanchez', 'Lopez', 'Garcia', 'Gonzalez' ],
                "Nota": [4.5, 8.9, 1.4, 5.6, 7.8]
                }
matriz_4 = pd.DataFrame(diccionario)

matriz_4.iloc[2,3] # Acceder a la matriz por el indice

1.4

In [233]:
matriz_4.iloc[1:3] # Mostrar 2 filas pero con todas las columnas de la tabla

   Id     Nombre Apellido  Nota
1   2      Pedro  Sanchez   8.9
2   3  Estefania    Lopez   1.4

In [234]:
matriz_4.iloc[1:3,]

   Id     Nombre Apellido  Nota
1   2      Pedro  Sanchez   8.9
2   3  Estefania    Lopez   1.4

In [235]:
matriz_4.iloc[1:3,:]

   Id     Nombre Apellido  Nota
1   2      Pedro  Sanchez   8.9
2   3  Estefania    Lopez   1.4

In [236]:
matriz_4.iloc[1:3,:3] # Mostrar los datos desde la segunda hasta la tercera fila, y solo mostrando las 3 primeras columnas

   Id     Nombre Apellido
1   2      Pedro  Sanchez
2   3  Estefania    Lopez

In [237]:
matriz_4.iloc[1:3:3] # Mostrar obtener los datos desde la segunda fila, y solo mostrando las 3 primeras columnas

   Id Nombre Apellido  Nota
1   2  Pedro  Sanchez   8.9

In [238]:
matriz_4.iloc[:,:2] # Mostrar todas las filas, pero solo mostrando las 2 primeras columnas

   Id     Nombre
0   1       Juan
1   2      Pedro
2   3  Estefania
3   4        Ana
4   5    Esteban

In [239]:
matriz_4.iloc[:,0:2] # Mostrar todas las filas, pero solo mostrando las 2 primeras columnas

   Id     Nombre
0   1       Juan
1   2      Pedro
2   3  Estefania
3   4        Ana
4   5    Esteban

In [240]:
# Tambi√©n funciona para seleccionar diferentes columnas y/o filas:
matriz_4.iloc[1:4,[1,3]] # mostrar ciertas columnas: nombre y nota

      Nombre  Nota
1      Pedro   8.9
2  Estefania   1.4
3        Ana   5.6

In [241]:
matriz_4.iloc[[1,4],[1,3]] # mostrar ciertas filas y ciertas columnas

    Nombre  Nota
1    Pedro   8.9
4  Esteban   7.8

In [242]:
matriz_4.iloc[[2,4]] # Mostrar la tercera y la quinta fila

   Id     Nombre  Apellido  Nota
2   3  Estefania     Lopez   1.4
4   5    Esteban  Gonzalez   7.8

In [243]:
matriz_4.iloc[1,:] # 1 representa la segunda fila

Id                2
Nombre        Pedro
Apellido    Sanchez
Nota            8.9
Name: 1, dtype: object

In [244]:
matriz_4.iloc[1]

Id                2
Nombre        Pedro
Apellido    Sanchez
Nota            8.9
Name: 1, dtype: object

In [245]:
data2 = [['Juan', 4.5], ['Pedro', 8.91], ['Estefania', 1.4], ['Ana', 5.6], ['Esteban', 7.8]]
columnas = ['Nombre', 'Nota']
filas = list(range(10, len(data2) + 10)) # [0,1,2,3,4]
matriz_5 = pd.DataFrame(data=data2, columns=columnas, index=filas)
matriz_5

       Nombre  Nota
10       Juan  4.50
11      Pedro  8.91
12  Estefania  1.40
13        Ana  5.60
14    Esteban  7.80

In [246]:
matriz_5.loc[11] 
# matriz.loc[1] # KeyError

Nombre    Pedro
Nota       8.91
Name: 11, dtype: object

In [247]:
matriz_5.iloc[1,:] # 1 representa la segunda fila, por accedemos por la posicion del indice, no por la columna id

Nombre    Pedro
Nota       8.91
Name: 11, dtype: object

In [248]:
matriz_5.loc[11, ['Nota']] # mostrar la nota de Pedro [indice, ['columna']]

Nota    8.91
Name: 11, dtype: object

In [249]:
matriz_5.loc[11]['Nota']

8.91

In [250]:
matriz_5.loc[11:13]['Nota'] # Muestra los datos de la columna nota desde la segunda hasta la cuarta fila

11    8.91
12    1.40
13    5.60
Name: Nota, dtype: float64

In [251]:
matriz_5.loc[[11,13], ['Nota']] # Muestra los datos de la columna nota desde la segunda hasta la cuarta fila

    Nota
11  8.91
13  5.60

In [252]:
matriz_5['Nota'].loc[11]

8.91

In [253]:
matriz_5.loc[11]['Nota']

8.91

In [254]:
matriz_4[['Nombre', 'Apellido']]

      Nombre  Apellido
0       Juan    Garcia
1      Pedro   Sanchez
2  Estefania     Lopez
3        Ana    Garcia
4    Esteban  Gonzalez

In [255]:
matriz_4[['Nombre', 'Apellido']].loc[3]

Nombre         Ana
Apellido    Garcia
Name: 3, dtype: object

In [256]:
matriz_4.loc[3][['Nombre', 'Apellido']]

Nombre         Ana
Apellido    Garcia
Name: 3, dtype: object

In [257]:
matriz_4[['Nombre', 'Apellido']].loc[4]

Nombre       Esteban
Apellido    Gonzalez
Name: 4, dtype: object

In [258]:
resultado = ['Suspenso', 'Aprobado', 'Suspenso', 'Aprobado', 'Aprobado']
matriz_4.insert(loc=3, column="Resultado", value=resultado)
matriz_4

   Id     Nombre  Apellido Resultado  Nota
0   1       Juan    Garcia  Suspenso   4.5
1   2      Pedro   Sanchez  Aprobado   8.9
2   3  Estefania     Lopez  Suspenso   1.4
3   4        Ana    Garcia  Aprobado   5.6
4   5    Esteban  Gonzalez  Aprobado   7.8

In [259]:
matriz_2._append(matriz_3, ignore_index=True) # Las versiones de pandas a partir de la version 1.4.0 tienen el metodo append() protegido (protected)

   Id     Nombre  Apellido  Notas  Nota
0   1       Juan    Garcia    4.5   NaN
1   2      Pedro   Sanchez    8.9   NaN
2   3  Estefania     Lopez    1.4   NaN
3   4        Ana    Garcia    5.6   NaN
4   5    Esteban  Gonzalez    7.8   NaN
5   6     Silvia  Gonzalez    NaN   5.5
6   7      Pedro     Perez    NaN   8.9

In [260]:
matriz_6 = pd.concat([matriz_2, matriz_3], ignore_index=True)
matriz_6

   Id     Nombre  Apellido  Notas  Nota
0   1       Juan    Garcia    4.5   NaN
1   2      Pedro   Sanchez    8.9   NaN
2   3  Estefania     Lopez    1.4   NaN
3   4        Ana    Garcia    5.6   NaN
4   5    Esteban  Gonzalez    7.8   NaN
5   6     Silvia  Gonzalez    NaN   5.5
6   7      Pedro     Perez    NaN   8.9

In [261]:
matriz_4.groupby('Resultado').count()

           Id  Nombre  Apellido  Nota
Resultado
Aprobado    3       3         3     3
Suspenso    2       2         2     2

In [262]:
matriz_4.groupby(['Apellido', 'Resultado'])['Id'].count()

Apellido  Resultado
Garcia    Aprobado     1
          Suspenso     1
Gonzalez  Aprobado     1
Lopez     Suspenso     1
Sanchez   Aprobado     1
Name: Id, dtype: int64

In [267]:
data_3 = [[8, 'Jorge', 'Garcia', 'Suspenso', 4.5], [9, 'Maria', 'Gonzalez', 'Aprobado', 8.9]]
matriz_tmp = pd.DataFrame(data_3, columns=['Id', 'Nombre', 'Apellido', 'Resultado', 'Notas'])
matriz_7 = pd.concat([matriz_2, matriz_tmp], ignore_index=True)
matriz_7

   Id     Nombre  Apellido  Notas Resultado
0   1       Juan    Garcia    4.5       NaN
1   2      Pedro   Sanchez    8.9       NaN
2   3  Estefania     Lopez    1.4       NaN
3   4        Ana    Garcia    5.6       NaN
4   5    Esteban  Gonzalez    7.8       NaN
5   8      Jorge    Garcia    4.5  Suspenso
6   9      Maria  Gonzalez    8.9  Aprobado

In [216]:
resultado = matriz_7.groupby('Resultado').size()
resultado

Resultado
Aprobado    1
Suspenso    1
dtype: int64

In [225]:
resultado = matriz_7.groupby('Resultado').count()
resultado

           Id  Nombre  Apellido  Notas  Nota
Resultado
Aprobado    1       1         1      0     1
Suspenso    1       1         1      0     1

In [230]:
matriz_9 = pd.DataFrame([('Bike', 'Kawasaki', 186), 
                   ('Bike', 'Ducati Panigale', 202), 
                   ('Car', 'Bugatti Chiron', 304),  
                   ('Car', 'Jaguar XJ220', 210), 
                   ('Bike', 'Lightning LS-218', 218),  
                   ('Car', 'Hennessey Venom GT', 270), 
                   ('Bike', 'BMW S1000RR', 188)], 
                  columns =('Type', 'Name', 'top_speed(mph)'))

resultado = matriz_9["top_speed(mph)"].mean()
resultado

225.42857142857142

In [269]:
resultado = matriz_7["Notas"].mean()
resultado

5.942857142857143

### Tipos de merge
<ul>
    <li>inner: solo en comun</li>
    <li>left: todos los de la izquierda + en comun</li>
    <li>right: todos los de la derecha + en comun</li>
    <li>outer: todos</li>
</ul>

In [303]:
productos = [{'Id': 1, 'Nombre': 'Pantalla', 'Precio': 129.50},
             {'Id': 2, 'Nombre': 'Teclado', 'Precio': 49.95},
            {'Id': 3, 'Nombre': 'Raton', 'Precio': 19.75},
            {'Id': 4, 'Nombre': 'Scanner', 'Precio': 157.90}]
matriz_10 = pd.DataFrame(productos)

productos_2 = [{'Nombre': 'Pantalla', 'Proveedor': 'Lenovo'},
             {'Nombre': 'Teclado', 'Proveedor': 'Logitech'},
            {'Nombre': 'Raton', 'Proveedor': 'Microsoft'},
            {'Nombre': 'Impresora', 'Proveedor': 'HP'}]
matriz_11 = pd.DataFrame(productos_2)

print(matriz_10)
print(matriz_11)

   Id    Nombre  Precio
0   1  Pantalla  129.50
1   2   Teclado   49.95
2   3     Raton   19.75
3   4   Scanner  157.90
      Nombre  Proveedor
0   Pantalla     Lenovo
1    Teclado   Logitech
2      Raton  Microsoft
3  Impresora         HP

In [304]:
union = pd.merge(matriz_10, matriz_11, how='inner', on=['Nombre'])
union

   Id    Nombre  Precio  Proveedor
0   1  Pantalla  129.50     Lenovo
1   2   Teclado   49.95   Logitech
2   3     Raton   19.75  Microsoft

In [305]:
union = pd.merge(matriz_10, matriz_11, how='left', on=['Nombre']) # Une los datos comunes, mas los datos del primer dataframe
union

   Id    Nombre  Precio  Proveedor
0   1  Pantalla  129.50     Lenovo
1   2   Teclado   49.95   Logitech
2   3     Raton   19.75  Microsoft
3   4   Scanner  157.90        NaN

In [306]:
union = pd.merge(matriz_10, matriz_11, how='right', on=['Nombre']) # Une los datos comunes, mas los datos del primer dataframe
union

    Id     Nombre  Precio  Proveedor
0  1.0   Pantalla  129.50     Lenovo
1  2.0    Teclado   49.95   Logitech
2  3.0      Raton   19.75  Microsoft
3  NaN  Impresora     NaN         HP

In [307]:
union = pd.merge(matriz_10, matriz_11, how='outer', on=['Nombre']) # Une todos los datos
union

    Id     Nombre  Precio  Proveedor
0  NaN  Impresora     NaN         HP
1  1.0   Pantalla  129.50     Lenovo
2  3.0      Raton   19.75  Microsoft
3  4.0    Scanner  157.90        NaN
4  2.0    Teclado   49.95   Logitech

### Ordenar

In [308]:
union.sort_values('Nombre', ascending=False)

    Id     Nombre  Precio  Proveedor
4  2.0    Teclado   49.95   Logitech
3  4.0    Scanner  157.90        NaN
2  3.0      Raton   19.75  Microsoft
1  1.0   Pantalla  129.50     Lenovo
0  NaN  Impresora     NaN         HP

In [309]:
union.sort_values('Nombre')

    Id     Nombre  Precio  Proveedor
0  NaN  Impresora     NaN         HP
1  1.0   Pantalla  129.50     Lenovo
2  3.0      Raton   19.75  Microsoft
3  4.0    Scanner  157.90        NaN
4  2.0    Teclado   49.95   Logitech

### Filtrar

In [310]:
union[union['Proveedor'] == 'HP']

   Id     Nombre  Precio Proveedor
0 NaN  Impresora     NaN        HP

In [311]:
union[union['Precio'] < 100]

    Id   Nombre  Precio  Proveedor
2  3.0    Raton   19.75  Microsoft
4  2.0  Teclado   49.95   Logitech

In [312]:
'''filtro = (union['Nombre'].str.len() > 5) & (union['Precio'] < 100)
union[filtro]'''

union[(union['Nombre'].str.len() > 5) & (union['Precio'] < 100)]

    Id   Nombre  Precio Proveedor
4  2.0  Teclado   49.95  Logitech

### Borrar

<ul>
    <li>axis 1 : eliminar columnas</li>
    <li>axis 0 : eliminar filas</li>
</ul>

In [314]:
# Si borro una columna, para que el dataframe se actualize hay que hacer una asignacion
matriz_12 = matriz_7.drop('Id', axis=1)
matriz_12

      Nombre  Apellido  Notas Resultado
0       Juan    Garcia    4.5       NaN
1      Pedro   Sanchez    8.9       NaN
2  Estefania     Lopez    1.4       NaN
3        Ana    Garcia    5.6       NaN
4    Esteban  Gonzalez    7.8       NaN
5      Jorge    Garcia    4.5  Suspenso
6      Maria  Gonzalez    8.9  Aprobado

In [318]:
matriz_12 = matriz_7.drop(['Id', 'Resultado'], axis=1) # Eliminar dos columnas
matriz_12

      Nombre  Apellido  Notas
0       Juan    Garcia    4.5
1      Pedro   Sanchez    8.9
2  Estefania     Lopez    1.4
3        Ana    Garcia    5.6
4    Esteban  Gonzalez    7.8
5      Jorge    Garcia    4.5
6      Maria  Gonzalez    8.9

In [319]:
matriz_13 = matriz_7.drop(5, axis=0) # Borrar la fila de 5 que es la de Jorge
matriz_13

   Id     Nombre  Apellido  Notas Resultado
0   1       Juan    Garcia    4.5       NaN
1   2      Pedro   Sanchez    8.9       NaN
2   3  Estefania     Lopez    1.4       NaN
3   4        Ana    Garcia    5.6       NaN
4   5    Esteban  Gonzalez    7.8       NaN
6   9      Maria  Gonzalez    8.9  Aprobado

In [320]:
matriz_14 = matriz_7.drop([0,2], axis=0)
matriz_14

   Id   Nombre  Apellido  Notas Resultado
1   2    Pedro   Sanchez    8.9       NaN
3   4      Ana    Garcia    5.6       NaN
4   5  Esteban  Gonzalez    7.8       NaN
5   8    Jorge    Garcia    4.5  Suspenso
6   9    Maria  Gonzalez    8.9  Aprobado

In [321]:
matriz_15 = matriz_7.drop(range(0,2), axis=0)
matriz_15

   Id     Nombre  Apellido  Notas Resultado
2   3  Estefania     Lopez    1.4       NaN
3   4        Ana    Garcia    5.6       NaN
4   5    Esteban  Gonzalez    7.8       NaN
5   8      Jorge    Garcia    4.5  Suspenso
6   9      Maria  Gonzalez    8.9  Aprobado

### Valores unicos

In [322]:
matriz_15['Apellido'].unique()

array(['Lopez', 'Garcia', 'Gonzalez'], dtype=object)

In [323]:
matriz_15['Apellido'].unique().tolist()

['Lopez', 'Garcia', 'Gonzalez']